Tekla Open API Reference for Tekla Structures 2025
Circle Constructor (ViewBase, Point, Double, Circle.CircleAttributes)
 Creates a new circle instance with a center point and a radius using the given attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Circle(
	ViewBase view,
	Point centerPoint,
	double radius,
	Circle.CircleAttributes attributes
)
Public Sub New (
	view As ViewBase,
	centerPoint As Point,
	radius As Double,
	attributes As Circle.CircleAttributes
)
Parameters
view
Type: Tekla.Structures.Drawing.ViewBase
The view to be used.
centerPoint
Type: Tekla.Structures.Geometry3d.Point
The center point to be used.
radius
Type: System.Double
The radius to be used.
attributes
Type: Tekla.Structures.Drawing.Circle.CircleAttributes
The circle attributes to be used.
See Also
Reference
Circle Class
Circle Overload
Tekla.Structures.Drawing Namespace